# RbsPipeInvertElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeInvertElevation Property
ParameterTypeId Class See Also
---
"Invert Elevation": This parameter is obsolete. It exists only for compatibility.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeInvertElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeInvertElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeInvertElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace